app/controllers/welcome_controller.rb

  def index

  	@testimonials = Testimonial.where(show: true)
---
SELECT "testimonials".* FROM "testimonials" WHERE "testimonials"."show" = ?  [["show", "t"]]